Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# Privacy_CategoriesOfPersonalInformatio.Text
source: Categories of Personal Information
de: Kategorien personenbezogener Informationen
es: Categorías de información personal
fr: Catégories d'informations personnelles
ja: 個人情報のカテゴリ
zh_cn: 个人信息类别

# Privacy_DocumentsAndFilesYou.Text
source: Documents and files you import
de: Von Ihnen importierte Dokumente und Dateien
es: Documentos y archivos que importa
fr: Documents et fichiers que vous importez
ja: インポートしたドキュメントとファイル
zh_cn: 您导入的文档和文件

# Privacy_AiConversationHistory.Text
source: AI conversation history
de: KI-Konversationsverlauf
es: Historial de conversaciones con IA
fr: Historique des conversations IA
ja: AI 会話履歴
zh_cn: AI 会话历史

# Privacy_ApplicationPreferences.Text
source: Application preferences
de: Anwendungseinstellungen
es: Preferencias de la aplicación
fr: Préférences de l'application
ja: アプリケーション設定
zh_cn: 应用程序偏好

# Privacy_NoSaleOfData.Text
source: No Sale of Data
de: Kein Datenverkauf
es: Sin venta de datos
fr: Aucune vente de données
ja: データ販売なし
zh_cn: 不出售数据

# Privacy_StrategiaXDoesNot.Text
source: Strategia-X does not sell, rent, or trade any user data. Your information is yours alone.
de: Strategia-X verkauft, vermietet oder handelt mit keinerlei Nutzerdaten. Ihre Informationen gehören allein Ihnen.
es: Strategia-X no vende, alquila ni comercia con ningún dato de usuario. Su información es solo suya.
fr: Strategia-X ne vend, ne loue ni n'échange aucune donnée utilisateur. Vos informations n'appartiennent qu'à vous.
ja: Strategia-X がユーザー データを販売、貸与、取引することはありません。あなたの情報はあなただけのものです。
zh_cn: Strategia-X 不出售、出租或交易任何用户数据。您的信息只属于您自己。

# Privacy_DataSecurity.Text
source: Data Security
de: Datensicherheit
es: Seguridad de los datos
fr: Sécurité des données
ja: データ セキュリティ
zh_cn: 数据安全

# Privacy_YourDataSecurityDepends.Text
source: Your data security depends on your device's security. Since all data remains local, you benefit from your operating system's built-in protections.
de: Die Sicherheit Ihrer Daten hängt von der Sicherheit Ihres Geräts ab. Da alle Daten lokal bleiben, profitieren Sie von den integrierten Schutzmechanismen Ihres Betriebssystems.
es: La seguridad de sus datos depende de la seguridad de su dispositivo. Como todos los datos permanecen locales, se beneficia de las protecciones integradas de su sistema operativo.
fr: La sécurité de vos données dépend de celle de votre appareil. Comme toutes les données restent locales, vous bénéficiez des protections intégrées de votre système d'exploitation.
ja: データの安全性は、デバイスのセキュリティに依存します。すべてのデータがローカルに保たれるため、OS 標準の保護機能の恩恵を受けられます。
zh_cn: 您的数据安全取决于设备的安全性。由于所有数据都保留在本地,您可受益于操作系统的内置保护。

# Privacy_WeRecommendTheFollowing.Text
source: We recommend the following practices to keep your data secure:
de: Wir empfehlen folgende Maßnahmen, um Ihre Daten zu schützen:
es: Recomendamos las siguientes prácticas para mantener sus datos seguros:
fr: Nous recommandons les pratiques suivantes pour protéger vos données :
ja: データを安全に保つため、次の対策をおすすめします:
zh_cn: 我们建议采取以下做法来保护您的数据:

# Privacy_KeepYourOperatingSystem.Text
source: Keep your operating system and software updated
de: Halten Sie Betriebssystem und Software aktuell
es: Mantenga su sistema operativo y software actualizados
fr: Maintenez votre système d'exploitation et vos logiciels à jour
ja: OS とソフトウェアを常に最新の状態に保つ
zh_cn: 保持操作系统和软件为最新版本

# Privacy_UseStrongDevicePasswords.Text
source: Use strong device passwords and biometric locks where available
de: Verwenden Sie starke Gerätepasswörter und, wo verfügbar, biometrische Sperren
es: Use contraseñas de dispositivo seguras y bloqueos biométricos cuando estén disponibles
fr: Utilisez des mots de passe d'appareil robustes et des verrous biométriques lorsque disponibles
ja: 強力なデバイス パスワードと、利用可能な場合は生体認証ロックを使用する
zh_cn: 使用强设备密码,并在可用时启用生物识别锁

# Privacy_EncryptYourHardDrive.Text
source: Encrypt your hard drive (e.g., BitLocker on Windows)
de: Verschlüsseln Sie Ihre Festplatte (z. B. BitLocker unter Windows)
es: Cifre su disco duro (p. ej., BitLocker en Windows)
fr: Chiffrez votre disque dur (p. ex. BitLocker sous Windows)
ja: ハード ドライブを暗号化する (例: Windows の BitLocker)
zh_cn: 加密您的硬盘(例如 Windows 上的 BitLocker)

# Privacy_AgentXDoesNot.Text
source: Agent-X does not implement additional encryption beyond what your operating system provides.
de: Agent-X implementiert keine zusätzliche Verschlüsselung über die Ihres Betriebssystems hinaus.
es: Agent-X no implementa cifrado adicional más allá del que proporciona su sistema operativo.
fr: Agent-X n'implémente pas de chiffrement supplémentaire au-delà de celui fourni par votre système d'exploitation.
ja: Agent-X は、OS が提供する以上の追加暗号化は実装していません。
zh_cn: Agent-X 不在操作系统提供的加密之外实施额外加密。

# Privacy_NetworkSecurityByDefault.Text
source: Network security: by default, all AI processing is local. No data leaves your network.
de: Netzwerksicherheit: Standardmäßig erfolgt die gesamte KI-Verarbeitung lokal. Keine Daten verlassen Ihr Netzwerk.
es: Seguridad de red: por defecto, todo el procesamiento de IA es local. Ningún dato sale de su red.
fr: Sécurité réseau : par défaut, tout le traitement IA est local. Aucune donnée ne quitte votre réseau.
ja: ネットワーク セキュリティ: 既定では、AI 処理はすべてローカルで行われます。データがネットワークの外に出ることはありません。
zh_cn: 网络安全:默认情况下,所有 AI 处理均在本地进行。数据不会离开您的网络。

# Privacy_ChildrenSPrivacy.Text
source: Children's Privacy
de: Datenschutz für Kinder
es: Privacidad de los menores
fr: Confidentialité des enfants
ja: 児童のプライバシー
zh_cn: 儿童隐私

# Privacy_AgentXIsNot.Text
source: Agent-X is not directed at children under the age of 13. We do not knowingly collect personal information from children under 13. If you are a parent or guardian and believe your child has provided information through the application, please contact us so we can assist.
de: Agent-X richtet sich nicht an Kinder unter 13 Jahren. Wir erfassen wissentlich keine personenbezogenen Daten von Kindern unter 13 Jahren. Wenn Sie als Elternteil oder Erziehungsberechtigter glauben, dass Ihr Kind über die Anwendung Informationen bereitgestellt hat, kontaktieren Sie uns bitte, damit wir helfen können.
es: Agent-X no está dirigido a menores de 13 años. No recopilamos conscientemente información personal de menores de 13 años. Si usted es padre, madre o tutor y cree que su hijo ha proporcionado información a través de la aplicación, contáctenos para que podamos ayudarle.
fr: Agent-X ne s'adresse pas aux enfants de moins de 13 ans. Nous ne collectons pas sciemment d'informations personnelles auprès d'enfants de moins de 13 ans. Si vous êtes parent ou tuteur et pensez que votre enfant a fourni des informations via l'application, veuillez nous contacter afin que nous puissions vous aider.
ja: Agent-X は 13 歳未満の児童を対象としていません。13 歳未満の児童から故意に個人情報を収集することはありません。保護者の方で、お子様がアプリケーションを通じて情報を提供したと思われる場合は、対応いたしますので当社までご連絡ください。
zh_cn: Agent-X 不面向 13 岁以下的儿童。我们不会有意收集 13 岁以下儿童的个人信息。如果您是家长或监护人,并认为您的孩子通过应用提供了信息,请联系我们以便协助处理。

# Privacy_ChangesToThisPrivacy.Text
source: Changes to This Privacy Policy
de: Änderungen dieser Datenschutzerklärung
es: Cambios en esta Política de privacidad
fr: Modifications de cette politique de confidentialité
ja: 本プライバシー ポリシーの変更
zh_cn: 本隐私政策的变更

# Privacy_WeMayUpdateThis.Text
source: We may update this Privacy Policy from time to time. When we make changes, we will revise the effective date at the top of this page. Changes will be reflected in the application with an updated effective date.
de: Wir können diese Datenschutzerklärung von Zeit zu Zeit aktualisieren. Bei Änderungen passen wir das Gültigkeitsdatum oben auf dieser Seite an. Änderungen werden in der Anwendung mit aktualisiertem Gültigkeitsdatum angezeigt.
es: Podemos actualizar esta Política de privacidad ocasionalmente. Cuando hagamos cambios, revisaremos la fecha de entrada en vigor en la parte superior de esta página. Los cambios se reflejarán en la aplicación con una fecha de entrada en vigor actualizada.
fr: Nous pouvons mettre à jour cette politique de confidentialité de temps à autre. En cas de modification, nous réviserons la date d'entrée en vigueur en haut de cette page. Les changements seront reflétés dans l'application avec une date d'entrée en vigueur mise à jour.
ja: 本プライバシー ポリシーは随時更新されることがあります。変更の際は、このページ上部の発効日を改定します。変更内容は、更新された発効日とともにアプリケーションに反映されます。
zh_cn: 我们可能不时更新本隐私政策。做出更改时,我们会修订本页顶部的生效日期。更改将随更新后的生效日期反映在应用中。

# Privacy_WeEncourageYouTo.Text
source: We encourage you to review this Privacy Policy periodically to stay informed about how we protect your information.
de: Wir empfehlen, diese Datenschutzerklärung regelmäßig zu lesen, um informiert zu bleiben, wie wir Ihre Informationen schützen.
es: Le animamos a revisar esta Política de privacidad periódicamente para mantenerse informado sobre cómo protegemos su información.
fr: Nous vous encourageons à consulter régulièrement cette politique de confidentialité pour rester informé de la manière dont nous protégeons vos informations.
ja: 情報保護の取り組みを把握いただくため、本プライバシー ポリシーを定期的にご確認いただくことをおすすめします。
zh_cn: 我们建议您定期查看本隐私政策,以了解我们如何保护您的信息。

# Privacy_ContactUs.Text
source: Contact Us
de: Kontakt
es: Contáctenos
fr: Nous contacter
ja: お問い合わせ
zh_cn: 联系我们

# Privacy_IfYouHaveAny.Text
source: If you have any questions, concerns, or requests regarding this Privacy Policy or our data practices, please reach out to us.
de: Bei Fragen, Anliegen oder Anfragen zu dieser Datenschutzerklärung oder unseren Datenpraktiken kontaktieren Sie uns bitte.
es: Si tiene preguntas, inquietudes o solicitudes sobre esta Política de privacidad o nuestras prácticas de datos, contáctenos.
fr: Si vous avez des questions, préoccupations ou demandes concernant cette politique de confidentialité ou nos pratiques en matière de données, veuillez nous contacter.
ja: 本プライバシー ポリシーまたはデータの取り扱いについてご質問、ご懸念、ご要望がある場合は、お気軽にお問い合わせください。
zh_cn: 如果您对本隐私政策或我们的数据实践有任何疑问、顾虑或请求,请与我们联系。

# Privacy_Company.Text
source: Company
de: Unternehmen
es: Empresa
fr: Société
ja: 会社
zh_cn: 公司

# Privacy_PrivacyQuestions.Text
source: Privacy Questions
de: Fragen zum Datenschutz
es: Preguntas sobre privacidad
fr: Questions sur la confidentialité
ja: プライバシーに関するご質問
zh_cn: 隐私相关问题

# Privacy_GdprDataProtectionContact.Text
source: GDPR Data Protection Contact
de: DSGVO-Datenschutzkontakt
es: Contacto de protección de datos (RGPD)
fr: Contact protection des données (RGPD)
ja: GDPR データ保護窓口
zh_cn: GDPR 数据保护联系人

# Privacy_ForGdprInquiriesOur.Text
source: For GDPR inquiries, our Data Protection contact can be reached at support@strategia-x.com
de: Für DSGVO-Anfragen erreichen Sie unseren Datenschutzkontakt unter support@strategia-x.com
es: Para consultas sobre el RGPD, puede contactar con nuestro responsable de protección de datos en support@strategia-x.com
fr: Pour les demandes RGPD, notre contact protection des données est joignable à support@strategia-x.com
ja: GDPR に関するお問い合わせは、データ保護窓口 support@strategia-x.com までご連絡ください
zh_cn: 如有 GDPR 相关咨询,请联系我们的数据保护联系人:support@strategia-x.com

# Privacy_CcpaRequestsCaliforniaResident.Text
source: CCPA Requests (California Residents)
de: CCPA-Anfragen (Einwohner Kaliforniens)
es: Solicitudes CCPA (residentes de California)
fr: Demandes CCPA (résidents de Californie)
ja: CCPA 関連のご請求 (カリフォルニア州民)
zh_cn: CCPA 请求(加州居民)

# Privacy_CaliforniaResidentsMayContact.Text
source: California residents may contact us at support@strategia-x.com for any CCPA-related requests.
de: Einwohner Kaliforniens können uns für CCPA-bezogene Anfragen unter support@strategia-x.com kontaktieren.
es: Los residentes de California pueden contactarnos en support@strategia-x.com para cualquier solicitud relacionada con la CCPA.
fr: Les résidents de Californie peuvent nous contacter à support@strategia-x.com pour toute demande liée au CCPA.
ja: カリフォルニア州民の方は、CCPA 関連のご請求について support@strategia-x.com までご連絡ください。
zh_cn: 加州居民可通过 support@strategia-x.com 与我们联系,提出任何 CCPA 相关请求。

# Privacy_2026RockyElsalaymehFree.Text
source: © 2026 Rocky Elsalaymeh. Free and open-source under the MIT License.
de: © 2026 Rocky Elsalaymeh. Kostenlos und Open Source unter der MIT-Lizenz.
es: © 2026 Rocky Elsalaymeh. Gratuito y de código abierto bajo la licencia MIT.
fr: © 2026 Rocky Elsalaymeh. Gratuit et open source sous licence MIT.
ja: © 2026 Rocky Elsalaymeh. MIT ライセンスの下で無料かつオープンソース。
zh_cn: © 2026 Rocky Elsalaymeh。基于 MIT 许可证,免费且开源。

# Privacy_AgentXLocalFirst.Text
source: Agent-X — Local-First AI Personal Intelligence Hub
de: Agent-X — Local-First-KI-Hub für persönliche Intelligenz
es: Agent-X — Centro de inteligencia personal con IA local
fr: Agent-X — Hub d'intelligence personnelle IA local d'abord
ja: Agent-X — ローカルファーストの AI パーソナル インテリジェンス ハブ
zh_cn: Agent-X — 本地优先的 AI 个人智能中枢

# Terms_Legal.Text
source: LEGAL
de: RECHTLICHES
fr: MENTIONS LÉGALES
ja: 法的情報
zh_cn: 法律条款

# Terms_TermsOfService.Text
source: TERMS OF SERVICE
de: NUTZUNGSBEDINGUNGEN
es: TÉRMINOS DEL SERVICIO
fr: CONDITIONS D'UTILISATION
ja: 利用規約
zh_cn: 服务条款

# Terms_EffectiveDateFebruary26.Text
source: Effective Date: February 26, 2026
de: Gültig ab: 26. Februar 2026
es: Fecha de entrada en vigor: 26 de febrero de 2026
fr: Date d'entrée en vigueur : 26 février 2026
ja: 発効日: 2026 年 2 月 26 日
zh_cn: 生效日期:2026 年 2 月 26 日

# Terms_PleaseReadTheseTerms.Text
source: Please read these Terms of Service ('Terms') carefully before using Agent-X, a desktop application developed by Strategia-X ('Company', 'we', 'us', 'our'). By installing or using Agent-X, you agree to be bound by these Terms.
de: Bitte lesen Sie diese Nutzungsbedingungen („Bedingungen“) sorgfältig, bevor Sie Agent-X verwenden, eine von Strategia-X („Unternehmen“, „wir“, „uns“, „unser“) entwickelte Desktop-Anwendung. Durch Installation oder Nutzung von Agent-X erklären Sie sich mit diesen Bedingungen einverstanden.
es: Lea atentamente estos Términos del servicio ('Términos') antes de usar Agent-X, una aplicación de escritorio desarrollada por Strategia-X ('Compañía', 'nosotros', 'nos', 'nuestro'). Al instalar o usar Agent-X, acepta quedar vinculado por estos Términos.
fr: Veuillez lire attentivement ces Conditions d'utilisation (« Conditions ») avant d'utiliser Agent-X, une application de bureau développée par Strategia-X (« Société », « nous », « notre »). En installant ou en utilisant Agent-X, vous acceptez d'être lié par ces Conditions.
ja: Strategia-X(以下「当社」)が開発したデスクトップ アプリケーション Agent-X をご利用になる前に、本利用規約(以下「本規約」)をよくお読みください。Agent-X をインストールまたは使用することにより、本規約に拘束されることに同意したものとみなされます。
zh_cn: 在使用 Agent-X(由 Strategia-X,以下称“公司”“我们”,开发的桌面应用程序)之前,请仔细阅读本服务条款(以下称“条款”)。安装或使用 Agent-X,即表示您同意受本条款约束。

# Terms_1AcceptanceOfTerms.Text
source: 1. Acceptance of Terms
de: 1. Annahme der Bedingungen
es: 1. Aceptación de los Términos
fr: 1. Acceptation des Conditions
ja: 1. 規約への同意
zh_cn: 1. 条款的接受

# Terms_ByDownloadingInstallingOr.Text
source: By downloading, installing, or using Agent-X, you acknowledge that you have read, understood, and agree to be bound by these Terms. If you do not agree to these Terms, you must not use Agent-X. Your continued use of the application constitutes your ongoing acceptance of any updated Terms.
de: Durch Herunterladen, Installieren oder Nutzen von Agent-X bestätigen Sie, dass Sie diese Bedingungen gelesen und verstanden haben und sich an sie gebunden fühlen. Wenn Sie diesen Bedingungen nicht zustimmen, dürfen Sie Agent-X nicht verwenden. Ihre fortgesetzte Nutzung der Anwendung gilt als fortlaufende Annahme aktualisierter Bedingungen.
es: Al descargar, instalar o usar Agent-X, reconoce que ha leído, entendido y acepta quedar vinculado por estos Términos. Si no está de acuerdo con estos Términos, no debe usar Agent-X. Su uso continuado de la aplicación constituye su aceptación continua de cualquier Término actualizado.
fr: En téléchargeant, installant ou utilisant Agent-X, vous reconnaissez avoir lu, compris et accepté d'être lié par ces Conditions. Si vous n'acceptez pas ces Conditions, vous ne devez pas utiliser Agent-X. Votre utilisation continue de l'application vaut acceptation continue de toute Condition mise à jour.
ja: Agent-X をダウンロード、インストール、または使用することにより、本規約を読み、理解し、これに拘束されることに同意したものとみなされます。本規約に同意いただけない場合は、Agent-X を使用しないでください。アプリケーションの継続的な使用は、更新された規約への継続的な同意を意味します。
zh_cn: 下载、安装或使用 Agent-X,即表示您确认已阅读、理解并同意受本条款约束。如果您不同意本条款,则不得使用 Agent-X。您继续使用本应用即表示持续接受任何更新后的条款。

# Terms_2DescriptionOfService.Text
source: 2. Description of Service
de: 2. Beschreibung des Dienstes
es: 2. Descripción del servicio
fr: 2. Description du service
ja: 2. サービスの説明
zh_cn: 2. 服务说明

# Terms_AgentXIsA.Text
source: Agent-X is a local-first AI personal intelligence hub for Windows. It provides the following capabilities:
de: Agent-X ist ein Local-First-KI-Hub für persönliche Intelligenz unter Windows. Er bietet folgende Funktionen:
es: Agent-X es un centro de inteligencia personal con IA local para Windows. Ofrece las siguientes capacidades:
fr: Agent-X est un hub d'intelligence personnelle IA local d'abord pour Windows. Il offre les capacités suivantes :
ja: Agent-X は、Windows 向けのローカルファースト AI パーソナル インテリジェンス ハブです。次の機能を提供します:
zh_cn: Agent-X 是面向 Windows 的本地优先 AI 个人智能中枢。它提供以下功能:

# Terms_LocalAiChatVia.Text
source: Local AI chat via Ollama integration
de: Lokaler KI-Chat über Ollama-Integration
es: Chat de IA local mediante integración con Ollama
fr: Chat IA local via l'intégration Ollama
ja: Ollama 連携によるローカル AI チャット
zh_cn: 通过 Ollama 集成实现本地 AI 聊天

# Terms_DocumentManagementAndIndexing.Text
source: Document management and indexing
de: Dokumentverwaltung und Indexierung
es: Gestión e indexación de documentos
fr: Gestion et indexation de documents
ja: ドキュメントの管理とインデックス作成
zh_cn: 文档管理与索引

# Terms_RetrievalAugmentedGenerationRa.Text
source: Retrieval-augmented generation (RAG)
es: Generación aumentada por recuperación (RAG)
fr: Génération augmentée par récupération (RAG)
ja: 検索拡張生成 (RAG)
zh_cn: 检索增强生成(RAG)

# Terms_SemanticSearchAcrossYour.Text
source: Semantic search across your documents
de: Semantische Suche in Ihren Dokumenten
es: Búsqueda semántica en sus documentos
fr: Recherche sémantique dans vos documents
ja: ドキュメント全体のセマンティック検索
zh_cn: 跨文档的语义搜索

# Terms_ModelManagement.Text
source: Model management
de: Modellverwaltung
es: Gestión de modelos
fr: Gestion des modèles
ja: モデル管理
zh_cn: 模型管理

# Terms_HardwareCapabilityAnalysis.Text
source: Hardware capability analysis
de: Analyse der Hardware-Fähigkeiten
es: Análisis de capacidades del hardware
fr: Analyse des capacités matérielles
ja: ハードウェア性能の分析
zh_cn: 硬件能力分析

# Terms_AllProcessingOccursLocally.Text
source: All processing occurs locally on your device. Agent-X does not transmit your data to external servers for AI inference.
de: Die gesamte Verarbeitung erfolgt lokal auf Ihrem Gerät. Agent-X überträgt Ihre Daten nicht zur KI-Inferenz an externe Server.
es: Todo el procesamiento se realiza localmente en su dispositivo. Agent-X no transmite sus datos a servidores externos para la inferencia de IA.
fr: Tout le traitement s'effectue localement sur votre appareil. Agent-X ne transmet pas vos données à des serveurs externes pour l'inférence IA.
ja: すべての処理はデバイス上でローカルに行われます。Agent-X が AI 推論のためにデータを外部サーバーへ送信することはありません。
zh_cn: 所有处理均在您的设备本地进行。Agent-X 不会将您的数据传输到外部服务器进行 AI 推理。

# Terms_3LicenseGrant.Text
source: 3. License Grant
de: 3. Lizenzgewährung
es: 3. Concesión de licencia
fr: 3. Octroi de licence
ja: 3. ライセンスの付与
zh_cn: 3. 许可授予

# Terms_UnderTheMitLicense.Text
source: Under the MIT License you may freely:
de: Unter der MIT-Lizenz dürfen Sie frei:
es: Bajo la licencia MIT usted puede libremente:
fr: Sous licence MIT, vous pouvez librement :
ja: MIT ライセンスの下では、次のことを自由に行えます:
zh_cn: 根据 MIT 许可证,您可以自由地:

# Terms_UseAgentXFor.Text
source: Use Agent-X for any purpose — personal, commercial, or otherwise
de: Agent-X für jeden Zweck nutzen — privat, kommerziell oder anderweitig
es: Usar Agent-X para cualquier fin — personal, comercial o de otro tipo
fr: Utiliser Agent-X à toute fin — personnelle, commerciale ou autre
ja: 個人・商用を問わず、あらゆる目的で Agent-X を使用する
zh_cn: 将 Agent-X 用于任何目的 — 个人、商业或其他

# Terms_StudyModifyAndBuild.Text
source: Study, modify, and build upon the source code
de: Den Quellcode studieren, verändern und darauf aufbauen
es: Estudiar, modificar y desarrollar a partir del código fuente
fr: Étudier, modifier et développer à partir du code source
ja: ソース コードを調査、改変し、それを基に開発する
zh_cn: 研究、修改源代码并在其基础上构建

# Terms_DistributeAndSublicenseCopies.Text
source: Distribute and sublicense copies, with or without modification
de: Kopien mit oder ohne Änderungen verbreiten und unterlizenzieren
es: Distribuir y sublicenciar copias, con o sin modificaciones
fr: Distribuer et sous-licencier des copies, avec ou sans modification
ja: 改変の有無を問わず、複製物を配布およびサブライセンスする
zh_cn: 分发副本并再许可,无论是否经过修改

# Terms_IncludeAgentXIn.Text
source: Include Agent-X in your own projects, free of charge
de: Agent-X kostenlos in eigene Projekte einbinden
es: Incluir Agent-X en sus propios proyectos, sin coste alguno
fr: Inclure Agent-X dans vos propres projets, gratuitement
ja: 自分のプロジェクトに Agent-X を無償で組み込む
zh_cn: 免费将 Agent-X 纳入您自己的项目

# Terms_TheOnlyConditionIs.Text
source: The only condition is that the MIT copyright notice and permission notice be included in all copies or substantial portions of the software.
de: Die einzige Bedingung ist, dass der MIT-Copyright-Hinweis und der Genehmigungshinweis in allen Kopien oder wesentlichen Teilen der Software enthalten sind.
es: La única condición es que el aviso de copyright y el aviso de permiso de la licencia MIT se incluyan en todas las copias o partes sustanciales del software.
fr: La seule condition est que l'avis de copyright MIT et l'avis d'autorisation soient inclus dans toutes les copies ou parties substantielles du logiciel.
ja: 唯一の条件は、ソフトウェアのすべての複製物または実質的な部分に、MIT の著作権表示および許諾表示を含めることです。
zh_cn: 唯一的条件是,在软件的所有副本或实质部分中包含 MIT 版权声明和许可声明。

# Terms_4UserResponsibilities.Text
source: 4. User Responsibilities
de: 4. Pflichten des Nutzers
es: 4. Responsabilidades del usuario
fr: 4. Responsabilités de l'utilisateur
ja: 4. ユーザーの責任
zh_cn: 4. 用户责任

# Terms_YouAreResponsibleFor.Text
source: You are responsible for:
de: Sie sind verantwortlich für:
es: Usted es responsable de:
fr: Vous êtes responsable de :
ja: お客様は次の事項について責任を負います:
zh_cn: 您负责:

# Terms_EnsuringYourSystemMeets.Text
source: Ensuring your system meets the minimum hardware and software requirements for Agent-X
de: Sicherstellen, dass Ihr System die Mindestanforderungen an Hardware und Software für Agent-X erfüllt
es: Asegurarse de que su sistema cumple los requisitos mínimos de hardware y software de Agent-X
fr: Vous assurer que votre système répond aux exigences matérielles et logicielles minimales d'Agent-X
ja: システムが Agent-X の最小ハードウェア・ソフトウェア要件を満たしていることの確認
zh_cn: 确保您的系统满足 Agent-X 的最低硬件和软件要求

# Terms_InstallingAndMaintainingOllama.Text
source: Installing and maintaining Ollama separately, as it is not bundled with Agent-X
de: Separate Installation und Pflege von Ollama, da es nicht mit Agent-X gebündelt ist
es: Instalar y mantener Ollama por separado, ya que no viene incluido con Agent-X
fr: Installer et maintenir Ollama séparément, car il n'est pas fourni avec Agent-X
ja: Ollama の個別のインストールと維持管理 (Agent-X には同梱されていません)
zh_cn: 单独安装和维护 Ollama(其未与 Agent-X 捆绑)

# Terms_TheContentOfAny.Text
source: The content of any documents you import into or process through Agent-X
de: Den Inhalt aller Dokumente, die Sie in Agent-X importieren oder damit verarbeiten
es: El contenido de cualquier documento que importe o procese a través de Agent-X
fr: Le contenu de tout document que vous importez dans Agent-X ou traitez avec celui-ci
ja: Agent-X にインポートまたは Agent-X で処理するドキュメントの内容
zh_cn: 您导入或通过 Agent-X 处理的任何文档的内容
